source/app/Http/Controllers/Owner/ImageController.php

select * from `images` where `images`.`id` = '1' limit 1
delete from `images` where `id` = 1
---
    public function destroy($id)
    {
        //Storageにファイルが存在する場合は削除する。
        $image = Image::findOrFail($id);
        $storagePath = 'public/products/' . $image->filename;
        if (Storage::exists($storagePath)) {
            Storage::delete($storagePath);
        }

        $image->delete();