source/app/Http/Controllers/Owner/ImageController.php

select * from `images` where `images`.`id` = '2' limit 1
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
---
    public function __construct()
    {
        $this->middleware('auth:owners');

        // ミドルウェア
        // 自身が管理するImage以外は表示できないようにする
        $this->middleware(function ($request, $next) {
            $id = $request->route()->parameter('image');

            if (!is_null($id)) {
                $imagesOwnerId = Image::findOrFail($id)->owner->id;

select * from `images` where `owner_id` = 1 order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `images` where `owner_id` = 1
---
    public function index()
    {
        $images = Image::where('owner_id', Auth::id())
            ->orderBy('updated_at', 'DESC')
            ->paginate(20);

select * from `images` where `images`.`id` = '6' limit 1
---
    public function edit($id)
    {
        $image = Image::findOrFail($id);

select * from `products` where `image1` = '2' or `image2` = '2' or `image3` = '2' or `image4` = '2'
update `products` set `image1` = '', `products`.`updated_at` = '2022-09-11 08:35:16' where `id` = 2
select * from `images` where `images`.`id` = 2 limit 1
---
    public function destroy($id)
    {
        // 画像が製品に使われている場合、NULLにする（外部キー制約）
        $products = Product::where('image1', $id)
            ->orWhere('image2', $id)
            ->orWhere('image3', $id)
            ->orWhere('image4', $id)
            ->get();

        if (!empty($products)) {
            foreach ($products as $product) {
                $id = intval($id);
                if ($product->image1 === $id) {
                    $product->fill(['image1' => null])->save();
                }
                if ($product->image2 === $id) {
                    $product->fill(['image2' => null])->save();
                }
                if ($product->image3 === $id) {
                    $product->fill(['image3' => null])->save();
                }
                if ($product->image4 === $id) {
                    $product->fill(['image4' => null])->save();
                }
            }
        }

        //Storageにファイルが存在する場合は削除する。
        $image = Image::findOrFail($id);

delete from `images` where `id` = 2
---
            Storage::delete($storagePath);
        }

        $image->delete();