source/app/Http/Controllers/Owner/ProductController.php

select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `products` where `products`.`id` = '3' limit 1
select * from `shops` where `shops`.`id` = 1 limit 1
---
    public function __construct()
    {
        $this->middleware('auth:owners');

        // ミドルウェア
        // 自身が管理するProduct以外は表示できないようにする
        $this->middleware(function ($request, $next) {
            $id = $request->route()->parameter('product');

            if (!is_null($id)) {
                $productOwnerId = (int)Product::findOrFail($id)->shop->owner->id;

select * from `images` where `images`.`id` in (1)
select * from `owners` where `id` = 1 and `owners`.`deleted_at` is null
select * from `products` where `products`.`shop_id` in (1)
select * from `shops` where `shops`.`owner_id` in (1)
---
    public function index()
    {
        $ownerInfo = Owner::with('shop.product.imageFirst')->where('id', Auth::id())->get();

select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`
select * from `secondary_categories` where `secondary_categories`.`primary_category_id` in (1, 2, 3)
---
    public function create()
    {
        $shops = Shop::where('owner_id', Auth::id())
            ->select('id', 'name')
            ->get();

        $images = Image::where('owner_id', Auth::id())
            ->select('id', 'title', 'filename')
            ->orderBy('updated_at', 'desc')
            ->get();

        $categories = PrimaryCategory::with('secondaryCategory')->get();

insert into `products` (`name`, `information`, `price`, `sort_order`, `shop_id`, `secondary_category_id`, `image1`, `image2`, `image3`, `image4`, `is_selling`, `updated_at`, `created_at`) values ('z', 'a', '11', '', '1', '1', '', '', '', '', '1', '2022-09-10 16:40:36', '2022-09-10 16:40:36')
insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (5, 1, '1', '2022-09-10 16:40:36', '2022-09-10 16:40:36')
---
    public function store(ProductRequest $request)
    {
        try {
            DB::transaction(function () use ($request) {
                $product = Product::create($request->all());

                Stock::create([
                    'product_id' => $product->id,
                    'type' => 1,
                    'quantity' => $request->quantity
                ]);

select * from `products` where `products`.`id` = '3' limit 1
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 3
select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`
select * from `secondary_categories` where `secondary_categories`.`primary_category_id` in (1, 2, 3)
---
    public function edit($id)
    {
        $product = Product::findOrFail($id);
        $quantity = Stock::where('product_id', $product->id)->sum('quantity');

        $shops = Shop::where('owner_id', Auth::id())
            ->select('id', 'name')
            ->get();

        $images = Image::where('owner_id', Auth::id())
            ->select('id', 'title', 'filename')
            ->orderBy('updated_at', 'desc')
            ->get();

        $categories = PrimaryCategory::with('secondaryCategory')->get();

select * from `products` where `products`.`id` = '1' limit 1
select * from `t_stocks` where `t_stocks`.`product_id` in (2, 3, 4, 5)
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 1
select * from `products`
select * from `products` where `products`.`id` = '5' limit 1
update `products` set `image1` = '2', `products`.`updated_at` = '2022-09-11 08:30:55' where `id` = 5
---
    public function update(ProductRequest $request, $id)
    {
        $request->validate([
            'current_quantity' => 'required|integer'
        ]);

        // 在庫数に変動があった場合
        $product = Product::findOrFail($id);
        $quantity = Stock::where('product_id', $product->id)->sum('quantity');

        if (intval($request->input('current_quantity')) !== $quantity) {
            $id = $request->route()->parameter('product');
            return redirect()
                ->route('owner.products.edit', ['product' => $id])
                ->with([
                    'message' => '在庫数が変更されています。再度確認してください。',
                    'status' => 'alert',
                ])
                ->withInput();
        }

        // DB保存処理（トランザクション処理）
        try {
            DB::transaction(function () use ($request, $id) {
                // products
                $product = Product::findOrFail($id);
                $product->update($request->all());

insert into `t_stocks` (`product_id`, `type`, `quantity`, `updated_at`, `created_at`) values (3, '1', -50, '2022-09-10 21:53:05', '2022-09-10 21:53:05')
---
                    // 出庫
                    $quantity = $request->input('quantity') * -1;
                }
                Stock::create([
                    'product_id' => $product->id,
                    'type' => $request->input('type'),
                    'quantity' => $quantity,
                ]);

select * from `products` where `products`.`id` = '1' limit 1
delete from `products` where `id` = 1
---
    public function destroy($id)
    {
        $product = Product::findOrFail($id);
        $product->delete();