source/app/Http/Controllers/Users/ItemController.php

select `products`.`id` as `id`, `products`.`name` as `name`, `products`.`price`, `products`.`sort_order` as `sort_order`, `products`.`information`, `secondary_categories`.`name` as `category`, `image1`.`filename` as `filename` from `products` inner join (select `product_id`, sum(quantity) as quantity from `t_stocks` group by `product_id` having `quantity` > '0') as `stock` on `products`.`id` = `stock`.`product_id` inner join `shops` on `products`.`shop_id` = `shops`.`id` inner join `secondary_categories` on `products`.`secondary_category_id` = `secondary_categories`.`id` inner join `images` as `image1` on `products`.`image1` = `image1`.`id` inner join `images` as `image2` on `products`.`image2` = `image2`.`id` inner join `images` as `image3` on `products`.`image3` = `image3`.`id` inner join `images` as `image4` on `products`.`image4` = `image4`.`id` where `shops`.`is_selling` = 1 and `products`.`is_selling` = 1 limit 8 offset 0
select count(*) as aggregate from `products` inner join (select `product_id`, sum(quantity) as quantity from `t_stocks` group by `product_id` having `quantity` > '0') as `stock` on `products`.`id` = `stock`.`product_id` inner join `shops` on `products`.`shop_id` = `shops`.`id` inner join `secondary_categories` on `products`.`secondary_category_id` = `secondary_categories`.`id` inner join `images` as `image1` on `products`.`image1` = `image1`.`id` inner join `images` as `image2` on `products`.`image2` = `image2`.`id` inner join `images` as `image3` on `products`.`image3` = `image3`.`id` inner join `images` as `image4` on `products`.`image4` = `image4`.`id` where `shops`.`is_selling` = 1 and `products`.`is_selling` = 1
---
    public function index()
    {
        // 在庫数が１以上のテーブル取得（サブクエリ）
        $stocks = DB::table('t_stocks')
            ->select(
                'product_id',
                DB::raw('sum(quantity) as quantity')
            )->groupBy('product_id')
            ->having('quantity', '>', '0');

        // 条件に合致する製品情報を一覧取得
        $products = DB::table('products')
            ->joinSub($stocks, 'stock', function ($join) {
                $join->on('products.id', '=', 'stock.product_id');
            })
            ->join('shops', 'products.shop_id', '=', 'shops.id')
            ->join('secondary_categories', 'products.secondary_category_id', '=', 'secondary_categories.id')
            ->join('images as image1', 'products.image1', '=', 'image1.id')
            ->join('images as image2', 'products.image2', '=', 'image2.id')
            ->join('images as image3', 'products.image3', '=', 'image3.id')
            ->join('images as image4', 'products.image4', '=', 'image4.id')
            ->where('shops.is_selling', true)
            ->where('products.is_selling', true)
            ->select('products.id as id', 'products.name as name', 'products.price', 'products.sort_order as sort_order', 'products.information', 'secondary_categories.name as category', 'image1.filename as filename')
            ->paginate(8);

select * from `products` where `products`.`id` = '106' limit 1
---
    public function show($id)
    {
        $product = Product::findOrFail($id);